	var map = [{
			"area":"华东地区", 
			"city": ['上海','山东','江苏','浙江','福建'],
			"county" : [
				 ['宝贤区','奉贤区','闽行区','金山区','崇明岛'],
				 ['滨州市','德州市','东营市','菏泽市','济南市','济宁市','莱芜市','聊城市','临沂市','青岛市','日照市','泰安市','威海市','潍坊市','烟台市','枣庄市','淄博市'],
				 ['南京市','南通市','苏州市','宿迁市','泰州市','无锡市','徐州市','盐城市','扬州市','镇江市','常州市','淮安市','连云港市'],
				 ['杭州市','湖州市','嘉兴市','金华市','丽水市','宁波市','衢州市','绍兴市','台州市','温州市','舟山市'],
				 ['厦门市','福州市','龙岩市','南平市','宁德市','莆田市','泉州市','三明市','漳州市']
			]
		},
		{
			"area":"华南地区", 
			"city": ['广东','广西','海南'],
			"county" : [
				['广州市','深圳市','东莞市','佛山市','河源市','惠州市','江门市','揭阳市','茂名市','梅州市','清远市','汕头市','汕尾市','韶关市','阳江市','云浮市','湛江市','肇庆市','中山市','珠海市','潮州市'],
				['南宁市','柳州市','桂林市','百色市','北海市','崇左市','防城港市','贵港市','河池市','贺州市','来宾市','钦州市','梧州市','玉林市'],
				['三亚','海口']
			]
		},
		{
			"area":"华中地区", 
			"city": ['湖南','湖北','江西','河南'],
			"county" : [
				['长沙市','衡阳市','常德市','郴州市','怀化市','娄底市','邵阳市','湘潭市','湘西土族','益阳市','永州市','岳阳市','张家界市','株洲市'],
				['武汉市','咸宁市','随州市','襄樊市','孝感市','宜昌市','鄂州市','恩施土苗','黄冈市','黄石市','荆门市','荆州市','十堰市'],
				['南昌市','上饶市','抚州市','九江市','赣州市','吉安市','景德镇市','萍乡市','新余市','宜春市','鹰潭市'],
				['洛阳市','郑州市','开封市','安阳市','南阳市','鹤壁市','焦作市','漯河市','平顶山市','濮阳市','三门峡市','商丘市','新乡市','信阳市','许昌市','周口市','驻马店市']
			]
		},
		{
			"area":"华北地区", 
			"city": ['北京','天津','河北','山西','内蒙'],
			"county" : [
				['朝阳区','东城区','西城区','海淀区','丰台区','通州区','顺义区','大兴区','昌平区','房山区','怀柔区','平谷区','顺义区','密云县','延庆县','石景山区'],
				['和平','河西','河东','南开','红桥','河北','西青','津南','北辰','大港','汉沽','宝坻','武清','宁河','静海','远郊区','郊县蓟县'],
				['保定市','沧州市','承德市','邯郸市','衡水市','廊坊市','秦皇岛市','石家庄市','唐山市','邢台市','张家口市'],
				['太原市','长治市','大同市','晋城市','晋中市','临汾市','吕梁市','朔州市','忻州市','阳泉市','运城市'],
				['包头市','赤峰市','乌海市','通辽市','兴安盟','阿拉善盟','巴彦淖尔市','鄂尔多斯市','呼和浩特市','呼伦贝尔市','乌兰察布市','锡林郭勒盟']
			]
		},
		{
			"area":"西南地区", 
			"city": ['云南','贵州','四川','西藏','重庆'],
			"county" : [
				['昆明市','丽江市','大理白族自治州','保山市','楚雄彝族自治州','德宏傣族景颇族自治州','迪庆藏族自治州','红河哈尼族彝族自治州','临沧市','怒江僳僳族自治州','普洱市','曲靖市','文山壮族苗族自治州','西双版纳傣族自治州','玉溪市','昭通市'],
				['贵阳市','遵义市','安顺市','毕节地区','铜仁地区','六盘水市','黔东南苗族侗族自治州','黔南布依族苗族自治州','黔西南布依族苗族自治州'],
				['成都市','广安市','巴中市','达州市','德阳市','广元市','乐山市','泸州市','眉山市','绵阳市','内江市','南充市','遂宁市','雅安市','宜宾市','资阳市','自贡市','攀枝花市','甘孜藏族自治州','阿坝藏族羌族自治州','凉山彝族自治州'],
				['拉萨市','阿里地区','昌都地区','林芝地区','那曲地区','山南地区','日喀则地区'],
				['济南','淄博','德州','青州','济宁']
			]
		},
		{
			"area":"西北地区", 
			"city": ['宁夏','甘肃','青海','陕西','新疆'],
			"county" : [
				['银川市','固原市','吴忠市','中卫市','石嘴山市'],
				['酒泉市','白银市','定西市','金昌市','兰州市','陇南市','平凉市','庆阳市','天水市','武威市','张掖市','嘉峪关市','甘南藏族自治州','临夏回族自治州'],
				['西宁市','海东地区','果洛藏族自治州','海北藏族自治州','海南藏族自治州','黄南藏族自治州','玉树藏族自治州','海西蒙古族藏族自治州'],
				['西安市','延安市','渭南市','汉中市','安康市','宝鸡市','商洛市','铜川市','咸阳市','榆林市'],
				['和田地区','塔城地区','哈密地区','喀什地区','乌鲁木齐市','克拉玛依市','阿勒泰地区','阿克苏地区','吐鲁番地区','昌吉回族自治州','巴音郭楞蒙古自治州','博尔塔拉蒙古自治州','伊犁哈萨克自治州','克孜勒苏柯尔克孜自治州','自治区直辖县级行政区划']
			]
		},
		{
			"area":"东北地区", 
			"city": ['辽宁','吉林','黑龙江'],
			"county" : [
					['沈阳市','大连市','辽阳市','丹东市','抚顺市','鞍山市','铁岭市','本溪市','锦州市','朝阳市','阜新市','盘锦市','营口市','葫芦岛市'],
					['长春市','吉林市','四平市','白城市','通化市','白山市','辽源市','松原市','延边州'],
					['大庆市','鹤岗市','黑河市','绥化市','伊春市','鸡西市','哈尔滨市','佳木斯市','牡丹江市','七台河市','双鸭山市','齐齐哈尔市','大兴安岭地区']
			]
		},
		{
			"area":"港澳台区", 
			"city": ['台湾','香港','澳门'],
			"county" : [
				['台北市', '桃园市', '台南市', '高雄市', '基隆市', '新北市', '新竹市', '苗栗市', '台中市', '彰化市','南投市', '云林市', '宜兰市','嘉义市', '屏东市', '台东市','花莲市'],
				['中西区','东区','南区','湾仔区', '九龙城区','观塘区','深水埗区','黄大仙区','油尖旺区', '离岛区','葵青区','北区','西贡区','沙田区','大埔区','荃湾区','屯门区','元朗区'],
				['大堂区','望德堂区','风顺堂区','嘉模堂区','花地玛堂区','圣安多尼堂区','圣方济各堂区']
			]
		}
	];